In [2]:
import pandas as pd

In [182]:
data = [[1, 'Alice'], [2, 'Bob'], [13, 'John'], [6, 'Alex']]
students = pd.DataFrame(data, columns=['student_id', 'student_name']).astype({'student_id':'Int64', 'student_name':'object'})
data = [['Math'], ['Physics'], ['Programming']]
subjects = pd.DataFrame(data, columns=['subject_name']).astype({'subject_name':'object'})
data = [[1, 'Math'], [1, 'Physics'], [1, 'Programming'], [2, 'Programming'], [1, 'Physics'], [1, 'Math'], [13, 'Math'], [13, 'Programming'], [13, 'Physics'], [2, 'Math'], [1, 'Math']]
examinations = pd.DataFrame(data, columns=['student_id', 'subject_name']).astype({'student_id':'Int64', 'subject_name':'object'})
examinations

    student_id subject_name
0            1         Math
1            1      Physics
2            1  Programming
3            2  Programming
4            1      Physics
5            1         Math
6           13         Math
7           13  Programming
8           13      Physics
9            2         Math
10           1         Math

In [221]:
students

   student_id student_name
0           1        Alice
1           2          Bob
2          13         John
3           6         Alex

In [184]:
subjects

  subject_name
0         Math
1      Physics
2  Programming

In [222]:
subject_list = subjects['subject_name']
data = []

for i in range(students.shape[0]):
    for subject in subject_list:
        data.append([students.loc[i][0],students.loc[i][1],subject])
df = pd.DataFrame(data, columns=['student_id', 'student_name','subject_name'])
groupby_df = df.groupby()

ans_df

    student_id student_name subject_name
0            1        Alice         Math
1            1        Alice      Physics
2            1        Alice  Programming
3            2          Bob         Math
4            2          Bob      Physics
5            2          Bob  Programming
6           13         John         Math
7           13         John      Physics
8           13         John  Programming
9            6         Alex         Math
10           6         Alex      Physics
11           6         Alex  Programming

In [138]:
data

['Headphone,Basketball,T-Shirt', 'Pencil,Bible', 'Mask,Mask']

In [128]:
data = [[3, 5], [5, 1], [6, 5], [7, 4], [8, 6], [9, 2], [10, 4], [11,16], [12, 3], [13,5], [14, 3], [15, 16]]
orders = pd.DataFrame(data, columns=['order_number', 'customer_number']).astype({'order_number':'Int64', 'customer_number':'Int64'})
orders

    order_number  customer_number
0              3                5
1              5                1
2              6                5
3              7                4
4              8                6
5              9                2
6             10                4
7             11               16
8             12                3
9             13                5
10            14                3
11            15               16